{
  "papers": [
    {
      "title": "Миграция СУБД Oracle с RISC на Linux-x86 с помощью кроссплатформенных переносимых табличных пространств",
      "text": "В последнее время наблюдается рост интереса заказчиков к миграции СУБД Oracle Database с RISC-платформ (прежде всего это платформы Oracle SPARC и IBM Power) на Linux x86.\n\nЭтому способствует много причин. Oracle прекратил развитие SPARC-архитектуры, RISC-сервера в несколько раз дороже x86-серверов, комплектующие к ним стоят в несколько раз дороже, чем для x86-серверов. В то же время, платформа x86, благодаря стараниям компании AMD, за последние годы получила бурное развитие: на рынке стали доступны относительно недорогие 2-х сокетные системы с 128 процессорными ядрами, что суммарно дает 256 ядер на сервер (512 потоков с включенной технологией AMD SMT).\n\nТакже унификация аппаратного обеспечения инфраструктуры ПО (баз данных и серверов приложений) с помощью широко распространенной платформы Linux x86, значительно упрощает ее сопровождение и стоимость. Также устраняется зависимость от одного вендора, то есть от производителя RISC-серверов.\n\nВ данной статье будет подробна описана миграция СУБД Oracle Database с\nRISC-платформ на Linux x86 с минимальным временем простоя с помощью\nкроссплатформенных переносимых табличных пространств (Crossplatform\nTransportable Tablespaces)....",
      "category": [
        "Разработка",
        "IT"
      ]
    },
    {
      "title": "Кэширование в Django",
      "text": "В этой статье речь пойдет о кэшировании в Django. Вы узнаете, что такое кэширование и о его преимуществах, как настроить кэширование в Django, какие бэкенд-системы поддерживают Django, а также о лучших практиках кэширования. Все веб-разработчики имеют своей целью создание приложений с высокой производительностью. Разработка высокопроизводительных веб-приложений на популярном бэкенд-фреймворке Django не должна вызывать особых затруднений, поскольку Django поставляется с фреймворком кэширования. Он позволяет использовать различные механизмы кэширования, такие как кэш в памяти, файловое кэширование, кэш баз данных и т.д.\n\nВведение в кэширование в Django\nКэширование в веб-разработке — это техника для повышения производительности приложений. Каждое веб-приложение обладает ресурсами, которые постоянно используют его юзеры. Ресурсом может быть что угодно — от простой веб-страницы до данных, хранящихся в базе данных. Кэширование играет важную роль в увеличении скорости доступа к ресурсам....",
      "category": "Разработка"
    }
  ],
  "news": {
    "title": "Обзор изменений в законодательстве за июль 2024 года",
    "text": "В обзоре изменений за август 2024 года рассмотрим следующие темы:\n\n1.      Критическая информационная инфраструктура\n\nУточняются критерии отнесения ПАК к числу доверенных. Устанавливаются дополнительные требования при организации и осуществлении дистанционного управления значимыми объектами КИИ, функционирующими в сфере электроэнергетики.\n\n2.      Персональные данные\n\nРассмотрим изменения в 152-ФЗ в части обезличивания и уничтожения ПДн, новый индикатор риска нарушения требований при осуществлении контроля за обработкой ПДн, виды биометрических ПДн, на которые распространяется действие 572-ФЗ, и порядок обработки ПДн сотрудников ФСБ России.\n\n3.      Безопасность финансовых организаций\n\nБанк России представил новые Методические рекомендации по установлению и расчету показателей уровня риска ИБ при переводе денежных средств.\n\n4.      Иное\n\nПредставлены требования к провайдерам хостинга по включению их в перечень провайдеров хостинга и требования, предъявляемые при предоставлении ими вычислительной мощности. Вступили в силу изменения в требованиях к форме квалифицированного сертификата ключа проверки электронной подписи, положение о ГИС в области генетической информации, порядок формирования и ведения автоматизированных и централизованных баз ПДн о пассажирах и персонале транспортных средств и иное.",
    "category": "Менеджмент"
  },
  "comments": [
    "Интересно",
    "хорошо написано",
    "что-то не очень понятно...",
    "будет продолжение",
    "плохо",
    "хорошо",
    "автор молодец!",
    "Дубль. См  https:///...",
    "Последние три поста на вашем аккаунте похожи на посты данного автора ..."
  ]
}